In [1]:
import pandas as pd
import numpy as np

In [ ]:
# Sales1.csv파일을 dataframe으로 읽으시오 
# BasePay의 평균은 얼마인가?
# OverTimepay의 최대값은?
# 'JOSEPH DRISQLL'의 JOB TITLE은?
# TotalPayBenefit의 최고금액을 수령하는 사람의 이름은 ?

In [19]:
df = pd.read_csv("./data/Salaries1.csv")
df

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,49995,49996,Carl Jacobs Sr,Transit Operator,65612.03,15604.45,733.84,37250.65,81950.32,119200.97,2012,NaN,San Francisco,NaN
49996,49996,49997,Yee Lam,Social Work Supervisor,81284.05,0.00,2084.00,35831.69,83368.05,119199.74,2012,NaN,San Francisco,NaN
49997,49997,49998,Fe V Foronda,Licensed Vocational Nurse,68857.08,16740.17,873.92,32725.45,86471.17,119196.62,2012,NaN,San Francisco,NaN
49998,49998,49999,Alison Schlageter,Administrative Analyst,83710.58,0.00,0.00,35478.91,83710.58,119189.49,2012,NaN,San Francisco,NaN
49999,49999,50000,Nicholas Hancock,Senior Administrative Analyst,83785.84,0.00,0.00,35400.78,83785.84,119186.62,2012,NaN,San Francisco,NaN

In [22]:
df.groupby(["BasePay"]).mean()

,Unnamed: 0,Id,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
BasePay,,,,,,,,,,
0.00,34297.703297,34298.703297,291.958549,5256.096176,830.10,5548.054725,5553.527912,2011.006593,NaN,NaN
14.25,36087.000000,36088.000000,0.000000,56.140000,NaN,70.390000,70.390000,2011.000000,NaN,NaN
17.48,36150.000000,36151.000000,0.000000,0.300000,NaN,17.780000,17.780000,2011.000000,NaN,NaN
27.28,36142.500000,36143.500000,0.000000,0.000000,NaN,27.280000,27.280000,2011.000000,NaN,NaN
27.63,36138.000000,36139.000000,0.000000,0.000000,NaN,27.630000,27.630000,2011.000000,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
287747.89,36166.000000,36167.000000,0.000000,5274.570000,81824.37,293022.460000,374846.830000,2012.000000,NaN,NaN
294000.17,36165.000000,36166.000000,0.000000,0.000000,82001.94,294000.170000,376002.110000,2012.000000,NaN,NaN
294580.02,12.000000,13.000000,0.000000,0.000000,NaN,294580.020000,294580.020000,2011.000000,NaN,NaN
296943.01,36162.000000,36163.000000,0.000000,17816.590000,72047.88,314759.600000,386807.480000,2012.000000,NaN,NaN
302578.00,36160.000000,36161.000000,0.000000,18974.110000,69810.19,321552.110000,391362.300000,2012.000000,NaN,NaN

In [23]:
df.["OvertimePay"].max()

SyntaxError: invalid syntax (Temp/ipykernel_8496/1316198767.py, line 1)

In [17]:
df[["JOSEPH DRISQLL"]["JOB TITLE"]]

<>:1: SyntaxWarning: list indices must be integers or slices, not str; perhaps you missed a comma?
<>:1: SyntaxWarning: list indices must be integers or slices, not str; perhaps you missed a comma?
C:\Users\bitcamp\AppData\Local\Temp/ipykernel_8496/3485195279.py:1: SyntaxWarning: list indices must be integers or slices, not str; perhaps you missed a comma?
  df[["JOSEPH DRISQLL"]["JOB TITLE"]]

TypeError: list indices must be integers or slices, not str

In [25]:
df.["OvertimePay"].apply(max)           #element wise operation

SyntaxError: invalid syntax (Temp/ipykernel_8496/1316198767.py, line 1)

In [24]:
df.max()

Unnamed: 0                  49999
Id                          50000
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                  302578.0
OvertimePay             245131.88
OtherPay                400184.25
Benefits                 84681.82
TotalPay                567595.43
TotalPayBenefits        567595.43
Year                         2012
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

In [26]:
df.apply(max)

Unnamed: 0                  49999
Id                          50000
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                  302578.0
OvertimePay             245131.88
OtherPay                400184.25
Benefits                      NaN
TotalPay                567595.43
TotalPayBenefits        567595.43
Year                         2012
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

In [ ]:
df.["OvertimePay"].max()

In [29]:
# 'JOSEPH DRISQLL'의 JOB TITLE은?
df[df["EmployeeName"] == 'JOSEPH DRISQLL']["JobTitle"]

Series([], Name: JobTitle, dtype: object)

In [31]:
df.sort_values("TotalPayBenefits", ascending=False).iloc[0]["EmployeeName"]

'NATHANIEL FORD'

In [32]:
df.groupby("Year")["BasePay"].mean()

Year
2011     63595.956517
2012    106964.140280
Name: BasePay, dtype: float64

In [37]:
df["JobTitle"].value_counts().iloc[:5]

TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
Registered Nurse    1003
CUSTODIAN            796
Name: JobTitle, dtype: int64

In [36]:
sum(df[df["Year"] == 2011]['JobTitle'].value_counts() == 1)

200

In [48]:
jobtitle = df["JobTitle"].apply(lambda x : x.lower())
jobtitle

total = 0
for t in jobtitle:
    if 'chief' in t :
        total += 1
        
total

318

In [49]:
sum(df["JobTitle"].apply(lambda x : x.lower()).str.contains("chief"))

318